python/00_README.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>00_README</title>
<!-- 2014-03-04 Tue 12:13 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Toby Dylan Hocking" />
</head>
<body>
<div id="content">
<h1 class="title">00_README</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. Installing PrunedDP and SegAnnot</a></li>
<li><a href="#sec-2">2. Using PrunedDP</a></li>
<li><a href="#sec-3">3. Using SegAnnot</a></li>
</ul>
</div>
</div>
<p>
This directory contains the PrunedDP and SegAnnot Python extension
modules. These programs are for calculating maximum likelihood
segmentations, and are described in the paper "<a href="http://bioinformatics.oxfordjournals.org/content/early/2014/02/03/bioinformatics.btu072.short">SegAnnDB: interactive
Web-based genomic segmentation</a>" by Hocking et al, Bioinformatics 2014.
</p>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Installing PrunedDP and SegAnnot</h2>
<div class="outline-text-2" id="text-1">
<p>
Type <code>make</code> to compile the python code, and run a check to make sure it
gives the same results as the R code from which it was ported.
</p>

<p>
Type <code>python setup.py install</code> to install the PrunedDP and SegAnnot
extension modules.
</p>
</div>
</div>
<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Using PrunedDP</h2>
<div class="outline-text-2" id="text-2">
<div class="org-src-container">

<pre class="src src-python">from PrunedDP import PrunedDP
segmat = PrunedDP(y, kmax)
</pre>
</div>

<p>
where
</p>

<p>
<code>y</code> is a numpy float array representing the noisy measurements to
segment.
</p>

<p>
<code>kmax</code> is an int giving the maximum number of segments to consider,
should be &lt;= len(y).
</p>

<p>
<code>segmat</code> is a numpy int matrix giving the start end end indices of the
maximum likelihood segments, which are the solutions to the following
optimization problems, for k in 1,&#x2026;,kmax:
</p>

<p>
yhat<sup>k</sup> = argmin<sub>mu</sub> ||y-mu||_2^2 such that mu has k segments.
</p>
</div>
</div>
<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Using SegAnnot</h2>
<div class="outline-text-2" id="text-3">
<div class="org-src-container">

<pre class="src src-python">from SegAnnot import SegAnnotBases
result = SegAnnotBases(y, position, m, M)
</pre>
</div>

<p>
<code>position</code> is a numpy int32 array representing the positions at which
the noisy measurements y were measured.
</p>

<p>
<code>m</code> is a numpy int32 array representing the start position of each
annotated region having 1 breakpoint.
</p>

<p>
<code>M</code> is a numpy int32 array representing the start position of each
annotated region having 1 breakpoint.
</p>

<p>
<code>result</code> is a dictionary containing the following numpy arrays:
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />

<col  class="left" />

<col  class="left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="left">name</th>
<th scope="col" class="left">type</th>
<th scope="col" class="left">len</th>
<th scope="col" class="left">meaning</th>
</tr>
</thead>
<tbody>
<tr>
<td class="left">min</td>
<td class="left">int32</td>
<td class="left">len(m)+1</td>
<td class="left">segment start indices</td>
</tr>

<tr>
<td class="left">max</td>
<td class="left">int32</td>
<td class="left">len(m)+1</td>
<td class="left">segment end indices</td>
</tr>

<tr>
<td class="left">mu</td>
<td class="left">float</td>
<td class="left">len(m)+1</td>
<td class="left">segment means</td>
</tr>

<tr>
<td class="left">break_min</td>
<td class="left">int32</td>
<td class="left">len(m)</td>
<td class="left">probe positions before breakpoints</td>
</tr>

<tr>
<td class="left">break_max</td>
<td class="left">int32</td>
<td class="left">len(m)</td>
<td class="left">probe positions after breakpoints</td>
</tr>

<tr>
<td class="left">break_mid</td>
<td class="left">int32</td>
<td class="left">len(m)</td>
<td class="left">estimated breakpoint positions</td>
</tr>
</tbody>
</table>

<p>
which represents the solution to the following optimization problem:
</p>

<p>
yhat = argmin<sub>mu</sub> ||y-mu||_2^2 such that mu has 1 breakpoint/change
in each of the len(m) regions specified by m and M, and mu has no
other changes.
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Toby Dylan Hocking</p>
<p class="date">Created: 2014-03-04 Tue 12:13</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 23.3.1 (<a href="http://orgmode.org">Org</a> mode 8.2.5c)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
